Scripts/Scalability/Tsung/Test4/jabber_IQ_packets_1min.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="info" version="1.0">

	<clients>
		<client host="localhost" use_controller_vm="true" maxusers="50000"></client>
	</clients>

	<servers>
		<server host="neatocloud1j.rajatogo.com" port="5222" type="tcp"></server>
	</servers>

	<load>
		<arrivalphase phase="1" duration="10" unit="minute">
			<users arrivalrate="100" unit="second"></users>
		</arrivalphase>
	</load>
	<options>
 		<option type="ts_jabber" name="domain" value="neatocloud1j.rajatogo.com"></option>
 		<option name="file_server" id='userdb' value="jusers.csv"/>
	</options>

	<sessions>
		<session probability="80" name="robot_online" type="ts_jabber">

			<setdynvars sourcetype="file" fileid="userdb" delimiter=";" order="iter">
			   <var name="username" />
			   <var name="password" />
			</setdynvars>

		    <request subst='true'>
		     <jabber type="connect" ack="no_ack">
		        <xmpp_authenticate username="%%_username%%" passwd="%%_password%%"/>
		     </jabber>
		    </request>

			<thinktime value="1"></thinktime>

			<transaction name="authenticate">
				<request>
					<jabber type="auth_sasl" ack="local"></jabber>
				</request>

				<request>
					<jabber type="connect" ack="local"></jabber>
				</request>

				<request>
					<jabber type="auth_sasl_bind" ack="local"></jabber>
				</request>
				<request>
					<jabber type="auth_sasl_session" ack="local"></jabber>
				</request>
			</transaction>

			<request>
				<jabber type="presence:initial" ack="no_ack" />
			</request>

			<thinktime value="1"></thinktime>

			<transaction name="online">
				<request>
					<jabber type="chat" ack="no_ack" size="16" destination="online"></jabber>
				</request>
			</transaction>

			<thinktime value="300"></thinktime>

			<for from="1" to="2" var="index" incr="1">
				<request subst='true'>
					<jabber type="raw" ack="no_ack" data="&lt;iq from='%%_username%%@neatocloud1j.rajatogo.com/tsung' to='neatocloud1j.rajatogo.com' id='s2c1' type='result'/&gt;" />
				</request>
				<thinktime value="240"></thinktime>
			</for>

  			<transaction name="offline">
				<request>
					<jabber type="chat" ack="no_ack" size="56" destination="offline"></jabber>
				</request>
			</transaction>

			<thinktime value="1"></thinktime>
			
			<transaction name="close">
				<request>
					<jabber type="close" ack="no_ack"></jabber>
				</request>
			</transaction>

		</session>

		<session name="robot_ping" probability="20" type="ts_http">
			<thinktime value="300"></thinktime>
			<for from="1" to="4" var="index" incr="1">
 				<setdynvars sourcetype="random_number" start="1" end="10000">
        			<var name="serial_number" />
    			</setdynvars>
				<request subst="true">
					<http
						url="http://neatocloud1.rajatogo.com/api/rest/json/?method=robot.ping_from_robot"
						method="POST" version="1.1"
						contents="api_key=1e26686d806d82144a71ea9a99d1b3169adaad917&amp;serial_number=testing%%_serial_number%%"></http>
				</request>
				<thinktime value="60"></thinktime>
			</for>
		</session>

	</sessions>

</tsung>